app/controllers/listings_controller.rb

  def index
    # Display listings according to campus; defaults to user's pre-selected campus from registration
    @show_all = "#{params[:show_all]}"

    if current_user.present?
      @listings = Listing.select_listing\("campus", current_user.campus, @show_all).order('created_at DESC').page params[:page]
---
SELECT  "listings".* FROM "listings"  ORDER BY created_at DESC LIMIT 25 OFFSET 0

  def search
    @search_query = "#{params[:q]}"
    @listings = []

    @user = User.select_user("username", @search_query)
    @user = @user.listings if @user.present?
    if @search_query.empty?
      @listings = Listing.all.order("created_at DESC").page params[:page]
---
SELECT  "users".* FROM "users" WHERE (LOWER(username) LIKE LOWER('%hey%')) LIMIT 1
SELECT "listings".* FROM "listings" WHERE (LOWER(campus) LIKE LOWER('%hey%'))  ORDER BY created_at DESC
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "listings" LIMIT 25 OFFSET 0) subquery_for_count